app/Controllers/Tecnicas/Controlador.php

        $responsable = null;
        if ($tareaSeleccionada) {
            $modelUsuario = new \App\Models\Tecnicas\ModelsCrearUsuario();
            $responsable = $modelUsuario->find($tareaSeleccionada['id_usuario']);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '15'

        if ($subtareas) {
            $modelUsuario = new \App\Models\Tecnicas\ModelsCrearUsuario();
            foreach ($subtareas as &$subtarea) {
                $usuario = $modelUsuario->where('id', $subtarea['responsable'])->first();
---
SELECT *
FROM `usuarios`
WHERE `id` = '15'
 LIMIT 1



        $model = new \App\Models\Tecnicas\ModelCrearTarea();
        $model->insert($datosTarea);
---
INSERT INTO `tareas` (`tema`, `descripcion`, `prioridad`, `fechaVencimiento`, `fechaRecordatorio`, `id_usuario`) VALUES ('Tareas Ing Web', 'prueba compartir', 'baja', '23/5/2025', '15/5/2025', '15')

    public function Tarea()
    {

        $idTarea = $this->request->getPost('idTareaSeleccionada');

        // Obtener la tarea desde la base de datos
        $model = new \App\Models\Tecnicas\ModelCrearTarea();
        $tareaseleccionada = $model->find($idTarea);

        session()->set('tareaSeleccionada', $tareaseleccionada);
        session()->set('idTareaSeleccionada', $idTarea);

        // Obtener las subtareas

        $modelSub = new \App\Models\Tecnicas\ModelCrearSubTarea();
        $subtareas = $modelSub->where('idTareaPrincipal', $idTarea)->findAll();
---
SELECT *
FROM `tareas`
WHERE `tareas`.`id` = '27'
SELECT *
FROM `subtareas`
WHERE `idTareaPrincipal` = '27'

    public function archivarTarea()
    {

        $sesion = session();

        // Carga todas las tareas del usuario //

        $idUsuario = $sesion->get('usuario_id');

        $model = new \App\Models\Tecnicas\ModelCrearTarea();
        $tareas = $model->where('id_usuario', $idUsuario)->orderBy('fechaVencimiento', 'DESC')->findAll();
---
SELECT *
FROM `tareas`
WHERE `id_usuario` = '14'
ORDER BY `fechaVencimiento` DESC

    public function eliminarTarea()
    {

        // elimina la tarea
        $model = new \App\Models\Tecnicas\ModelCrearTarea();
        $model->delete(session()->get('idTareaSeleccionada'));

        // elimina las subTareas asociadas
        $modelSub = new \App\Models\Tecnicas\ModelCrearSubTarea();
        $modelSub->where('idTareaPrincipal', session()->get('idTareaSeleccionada'))->delete();

        // elimina los registros de la tabla compartidas
        $modelCompartida = new \App\Models\Tecnicas\ModelCompartidos();
        $modelCompartida->where('idTareaCompartida', session()->get('idTareaSeleccionada'))->delete();
---
DELETE FROM `tareas`
WHERE `id` IN ('25')
DELETE FROM `subtareas`
WHERE `idTareaPrincipal` = '25'
DELETE FROM `compartidos`
WHERE `idTareaCompartida` = '25'

            'mensaje'  => $anotacionTexto,
        );

        $modelo->insert($anotaciones);
---
INSERT INTO `anotaciones` (`id_usuario`, `id_tarea`, `mensaje`) VALUES ('15', '27', 'Prueba eliminar')