app/Controllers/Tecnicas/Controlador.php

        $responsable = null;
        if ($tareaSeleccionada) {
            $modelUsuario = new \App\Models\Tecnicas\ModelsCrearUsuario();
            $responsable = $modelUsuario->find($tareaSeleccionada['id_usuario']);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '14'